// Задайте двумерный массив размера m на n, каждый элемент в массиве находится по формуле: Aₘₙ = m+n. Выведите полученный массив на экран.
    
Console.Clear();

int[,] GetArray()
{
Console.Write("Количество строк массива: ");
int m = int.Parse(Console.ReadLine());
Console.Write("Количество столбцов массива: ");
int n = int.Parse(Console.ReadLine());

int[,]array = new int[m,n];
    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            array[i, j] = i + j;
        }
    }
    return array;
}

void PrintArray(int[,] array)                                        // метод для вывода массива на экран
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
        Console.WriteLine();
    }
}

int[,] Array = GetArray();
PrintArray(Array);